; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	satellite2 - satellite
	instrument2 - instrument
	satellite3 - satellite
	instrument3 - instrument
	image1 - mode
	thermograph0 - mode
	GroundStation3 - direction
	Star4 - direction
	Star6 - direction
	GroundStation7 - direction
	GroundStation8 - direction
	GroundStation11 - direction
	GroundStation12 - direction
	Star14 - direction
	Star9 - direction
	GroundStation2 - direction
	GroundStation13 - direction
	GroundStation5 - direction
	GroundStation0 - direction
	Star1 - direction
	GroundStation10 - direction
	Planet15 - direction
	Phenomenon16 - direction
	Planet17 - direction
	Star18 - direction
	Star19 - direction
	Planet20 - direction
	Planet21 - direction
)
(:init
	(supports instrument0 image1)
	(supports instrument0 thermograph0)
	(calibration_target instrument0 Star9)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Phenomenon16)
	(supports instrument1 image1)
	(supports instrument1 thermograph0)
	(calibration_target instrument1 GroundStation5)
	(calibration_target instrument1 GroundStation13)
	(calibration_target instrument1 GroundStation2)
	(on_board instrument1 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Phenomenon16)
	(supports instrument2 image1)
	(supports instrument2 thermograph0)
	(calibration_target instrument2 GroundStation0)
	(on_board instrument2 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Phenomenon16)
	(supports instrument3 image1)
	(supports instrument3 thermograph0)
	(calibration_target instrument3 GroundStation10)
	(calibration_target instrument3 Star1)
	(on_board instrument3 satellite3)
	(power_avail satellite3)
	(pointing satellite3 GroundStation2)
)
(:goal (and
	(pointing satellite0 Planet20)
	(pointing satellite2 GroundStation11)
	(have_image Planet15 image1)
	(have_image Phenomenon16 image1)
	(have_image Planet17 image1)
	(have_image Star18 thermograph0)
	(have_image Star19 thermograph0)
	(have_image Planet20 thermograph0)
	(have_image Planet21 thermograph0)
))

)

; plan
1. (turn_to satellite2 groundstation11 phenomenon16)
   deleted: (pointing satellite2 phenomenon16)
   added: (pointing satellite2 groundstation11)
   goals met: 1 of 9
2. (turn_to satellite0 star9 phenomenon16)
   deleted: (pointing satellite0 phenomenon16)
   added: (pointing satellite0 star9)
   goals met: 1 of 9
3. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 1 of 9
4. (calibrate satellite0 instrument0 star9)
   added: (calibrated instrument0)
   goals met: 1 of 9
5. (turn_to satellite0 planet17 star9)
   deleted: (pointing satellite0 star9)
   added: (pointing satellite0 planet17)
   goals met: 1 of 9
6. (take_image satellite0 planet17 instrument0 image1)
   added: (have_image planet17 image1)
   goals met: 2 of 9
7. (turn_to satellite0 planet15 planet17)
   deleted: (pointing satellite0 planet17)
   added: (pointing satellite0 planet15)
   goals met: 2 of 9
8. (take_image satellite0 planet15 instrument0 image1)
   added: (have_image planet15 image1)
   goals met: 3 of 9
9. (turn_to satellite0 phenomenon16 planet15)
   deleted: (pointing satellite0 planet15)
   added: (pointing satellite0 phenomenon16)
   goals met: 3 of 9
10. (take_image satellite0 phenomenon16 instrument0 image1)
   added: (have_image phenomenon16 image1)
   goals met: 4 of 9
11. (turn_to satellite0 planet21 phenomenon16)
   deleted: (pointing satellite0 phenomenon16)
   added: (pointing satellite0 planet21)
   goals met: 4 of 9
12. (take_image satellite0 planet21 instrument0 thermograph0)
   added: (have_image planet21 thermograph0)
   goals met: 5 of 9
13. (turn_to satellite0 star18 planet21)
   deleted: (pointing satellite0 planet21)
   added: (pointing satellite0 star18)
   goals met: 5 of 9
14. (take_image satellite0 star18 instrument0 thermograph0)
   added: (have_image star18 thermograph0)
   goals met: 6 of 9
15. (turn_to satellite0 star19 star18)
   deleted: (pointing satellite0 star18)
   added: (pointing satellite0 star19)
   goals met: 6 of 9
16. (take_image satellite0 star19 instrument0 thermograph0)
   added: (have_image star19 thermograph0)
   goals met: 7 of 9
17. (turn_to satellite0 planet20 star19)
   deleted: (pointing satellite0 star19)
   added: (pointing satellite0 planet20)
   goals met: 8 of 9
18. (take_image satellite0 planet20 instrument0 thermograph0)
   added: (have_image planet20 thermograph0)
   goals met: 9 of 9
